{
  "header-home": "Acerca de",
  "header-competences": "Habilidades",
  "header-projects": "Proyectos",
  "header-contact": "Cont谩ctame",
  "button-language-eng": "Ingl茅s",
  "button-language-fr": "Franc茅s",
  "button-language-esp": "Espa帽ol",
  "home-title": "Hola, soy Elena",
  "home-message": "Antigua realizadora de pel铆culas de animaci贸n, me reconvert铆 en desarrollo web. Estoy buscando empleo como desarrolladora/integradora web.",
  "home-button": "Descargar mi CV",
  "competences-title": "Mis habilidades",
  "competences-message": "Diferentes programas que utilizo",
  "works-title": "Mis trabajos",
  "works-message": "Varios proyectos completados:",
  "works-git": "Enlace de GitHub aqu铆",
  "contact-title": "Cont谩ctame",
  "contact-title-placeholder": "Tu correo electr贸nico ...",
  "contact-message": "隆Pongamonos en contacto!",
  "contact-message-placeholder": "Tu mensaje ...",
  "contact-modal": "Gracias! Tu mensaje se ha enviado! :D",
  "footer-message": "隆Gracias por tu visita! ",
  "travaux-argentbank": "Proyecto completado para mi formaci贸n como integrador web en Openclassrooms. Con la maqueta proporcionada, desarroll茅 el sitio web de ArgenBank con autenticaci贸n de usuario utilizando HTML, CSS, JavaScript, React, React Router, Redux, Sass, una API para la recuperaci贸n de datos y MongoDB para almacenar la informaci贸n de los usuarios. El resultado final es una aplicaci贸n web segura que permite a los clientes iniciar sesi贸n en su cuenta y ver sus transacciones bancarias. Este proyecto me permiti贸 fortalecer mis habilidades en React y descubrir la arquitectura Redux para la gesti贸n del estado en aplicaciones web.",
  "travaux-kasa": "Proyecto completado durante mi formaci贸n como integrador web en Openclassrooms. Desarroll茅 esta plataforma de alquiler de apartamentos utilizando HTML, CSS, JavaScript, junto con las bibliotecas React y React Router para crear interfaces de usuario din谩micas e interactivas. Tambi茅n utilic茅 Sass para la gesti贸n de estilos y una API para recuperar los datos a mostrar en la aplicaci贸n. Cre茅 un componente desplegable para las descripciones y comodidades de los apartamentos. El resultado final es un sitio web funcional donde los usuarios pueden navegar por los apartamentos y acceder a toda la informaci贸n de cada uno.",
  "travaux-724": "Proyecto completado como parte de mi formaci贸n como integrador web en Openclassrooms. Depur茅 y correg铆 varios problemas con el sitio web 724 events utilizando yarn test y las herramientas de desarrollo de Chrome. Este proyecto fue un gran ejercicio para practicar la depuraci贸n de un c贸digo que ya estaba creado.",
  "travaux-booki": "Proyecto completado como parte de mi formaci贸n como integrador web en Openclassrooms. Cre茅 una p谩gina web responsive para Booki, un sitio web de planificaci贸n de vacaciones. Integr茅 las versiones de escritorio, tableta y m贸vil de esta aplicaci贸n siguiendo una maqueta en Figma.",
  "travaux-nina": "Proyecto completado como parte de mi formaci贸n como integrador web en Openclassrooms. Depur茅 el portafolio de Nina Carducci, asegurando una mejor accesibilidad, rendimiento optimizado y SEO mejorado. Mejor茅 la accesibilidad al incorporar etiquetas sem谩nticas y una navegaci贸n clara para usuarios con discapacidades visuales. La optimizaci贸n del rendimiento se logr贸 mediante la compresi贸n de im谩genes, minimizaci贸n de archivos y t茅cnicas de mejora de la velocidad de carga de p谩ginas. Adem谩s, mejor茅 el SEO implementando etiquetas meta apropiadas, optimizando las URL y refinando la estructura del sitio para facilitar una mejor indexaci贸n por parte de los motores de b煤squeda.",
  "travaux-ohmy": "Proyecto completado como parte de mi formaci贸n como integrador web en Openclassrooms. A partir de una maqueta proporcionada en Figma, trabaj茅 en la integraci贸n de la versi贸n m贸vil de un sitio web de food tech con animaciones CSS. Este proyecto me permiti贸 aplicar mis habilidades en HTML y CSS mientras utilizaba Sass para la gesti贸n del c贸digo CSS. El resultado final es un sitio web moderno que muestra los platos ofrecidos por los diferentes restaurantes. Gracias al uso de Sass, pude aumentar la productividad y mantenibilidad del c贸digo CSS, lo que me permiti贸 organizar mejor mi c贸digo y hacerlo m谩s manejable y limpio.",
  "travaux-print": "Proyecto completado como parte de mi formaci贸n como integrador web en Openclassrooms. Dinamic茅 el sitio web de impresi贸n est谩tica Print it agregando un carrusel en JavaScript.",
  "travaux-sophie": "Proyecto completado como parte de mi formaci贸n como integrador web en Openclassrooms. Cre茅 un sitio web de portafolio din谩mico para el cliente Sophie Bluel con JavaScript, en el que el cliente puede recuperar y manejar sus datos a trav茅s de formularios y una p谩gina de inicio de sesi贸n. Pude practicar mis habilidades manipulando elementos del DOM y gestionando eventos de usuario con JavaScript."
}
